In [2]:
import pandas as pd
import numpy as np

In [3]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

In [7]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2["a"]

-5

In [9]:
obj2.index

Index([u'd', u'b', u'a', u'c'], dtype='object')

In [10]:
obj2[obj2>2]

d    4
b    7
c    3
dtype: int64

In [11]:
obj2*2

d     8
b    14
a   -10
c     6
dtype: int64

In [12]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
states = ['California', 'Ohio', 'Oregon', 'Texas']
states = pd.Series(sdata, index=states)

In [13]:
states

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [14]:
states.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [15]:
states.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [16]:
pd.isnull(states)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [17]:
states

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [18]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [19]:
obj.index = ["bodo","wang", "li","xiao"]

In [20]:
obj

bodo    4
wang    7
li     -5
xiao    3
dtype: int64

In [21]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [22]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [23]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
   ....:                       index=['one', 'two', 'three', 'four',
   ....:                              'five', 'six'])

frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [24]:
frame2["state"]

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [25]:
#这种方式非常不推荐
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [26]:
frame2["debt"] = 16.5

In [27]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [28]:
frame2["debt"] = np.arange(6.0)

In [29]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [30]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [31]:
frame2["debt"] = val

In [32]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [33]:
frame2["eastern"] = frame2["state"]=="Ohio"

In [34]:
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4  -1.5   False
five   2002  Nevada  2.9  -1.7   False
six    2003  Nevada  3.2   NaN   False

In [35]:
del frame2["eastern"]

In [36]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [37]:
 pop = {'Nevada': {2001: 2.4, 2002: 2.9},
....:        'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)

In [38]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [39]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [40]:
frame3.index.name ="year"
frame3.columns.name = "state"

In [41]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [42]:
frame3.index.name = None

In [43]:
frame3

state  Nevada  Ohio
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

####  索引对象

In [44]:
obj

bodo    4
wang    7
li     -5
xiao    3
dtype: int64

In [45]:
index = obj.index

In [46]:
index

Index([u'bodo', u'wang', u'li', u'xiao'], dtype='object')

In [47]:
index[1:]

Index([u'wang', u'li', u'xiao'], dtype='object')

index对象是不可变的，因此用户不能对其进行修改，不可变使得index对象在多个数据结构之间安全共享

In [48]:
index[1]="d"

TypeError: Index does not support mutable operations

In [49]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [50]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [51]:
obj.drop("c")

d    4.5
b    7.2
a   -5.3
dtype: float64

In [52]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [53]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
   .....:                     index=['Ohio', 'Colorado', 'Utah', 'New York'],
   .....:                     columns=['one', 'two', 'three', 'four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

drop默认是axis 0也就是行开始删除值，可以设置axis指定轴线上

In [54]:
data.drop(["Ohio", "Utah"])

          one  two  three  four
Colorado    4    5      6     7
New York   12   13     14    15

In [55]:
data.drop(["one", "three"], axis=1)

          two  four
Ohio        1     3
Colorado    5     7
Utah        9    11
New York   13    15

#### index. select and filter

In [56]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [57]:
obj[1]

7.2000000000000002

In [58]:
obj["b"]

7.2000000000000002

In [59]:
obj[2:4]

a   -5.3
c    3.6
dtype: float64

In [60]:
obj[["a", "b", "c"]]

a   -5.3
b    7.2
c    3.6
dtype: float64

use slice is different fron python's slice, it is include last

In [61]:
obj["b":"c"]

b    7.2
a   -5.3
c    3.6
dtype: float64

In [62]:
obj["b":"c"] = 5

In [63]:
obj

d    4.5
b    5.0
a    5.0
c    5.0
dtype: float64

In [64]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [65]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [66]:
data.loc[:"Utah"]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11

In [67]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [68]:
data[data["three"] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [69]:
data[data<5]=0

In [70]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

selection with loc and iloc
axis labels(loc) or integers(iloc)

In [71]:
data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int32

In [72]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [73]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [74]:
data.iloc[[1,2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [75]:
data.loc[:"Utah", "two"]

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [76]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [77]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=['a', 'c', 'e', 'f', 'g'])

####  interger indexes

In [78]:
ser = pd.Series(np.arange(3.))

In [79]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [80]:
ser2 = pd.Series(np.arange(3.), index=["a", "b", "c"])

In [81]:
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [82]:
ser2[-1]

2.0

In [83]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [84]:
ser.iloc[:1]

0    0.0
dtype: float64

In [85]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])
print s1,"\n", s2

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64
a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [86]:
s1+ s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [87]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
   .....:                    index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
   .....:                    index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [88]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [89]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [91]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [93]:
df1.add(df2, fill_value=0)

            b    c     d     e
Colorado  6.0  7.0   8.0   NaN
Ohio      3.0  1.0   6.0   5.0
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  4.0  12.0   8.0
Utah      0.0  NaN   1.0   2.0

In [94]:
df1.add?

In [95]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [97]:
1/df1

                 b         c      d
Ohio           inf  1.000000  0.500
Texas     0.333333  0.250000  0.200
Colorado  0.166667  0.142857  0.125

In [99]:
df1.rdiv(1)

                 b         c      d
Ohio           inf  1.000000  0.500
Texas     0.333333  0.250000  0.200
Colorado  0.166667  0.142857  0.125

In [101]:
df1.radd(df2)

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

####  dataframe and series operations

In [102]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
   .....:                      columns=list('bde'),
   .....:                      index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [103]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [106]:
frame.iloc[0]

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [107]:
series = frame.iloc[0]

In [108]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [109]:
frame-series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [110]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])

In [111]:
frame- series2

          b   d     e   f
Utah    0.0 NaN   1.0 NaN
Ohio    3.0 NaN   4.0 NaN
Texas   6.0 NaN   7.0 NaN
Oregon  9.0 NaN  10.0 NaN

In [112]:
series2

b    0
e    1
f    2
dtype: int64

In [115]:
series3 = frame.loc[:, "d"]

In [116]:
frame.sub(series3,axis="index")

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [118]:
frame.sub(series3,axis="columns")

        Ohio  Oregon  Texas  Utah   b   d   e
Utah     NaN     NaN    NaN   NaN NaN NaN NaN
Ohio     NaN     NaN    NaN   NaN NaN NaN NaN
Texas    NaN     NaN    NaN   NaN NaN NaN NaN
Oregon   NaN     NaN    NaN   NaN NaN NaN NaN

### function application and mapping

In [120]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
   .....:                      index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [121]:
frame

               b         d         e
Utah   -0.270924 -0.489953  0.451772
Ohio    1.258679  1.075300 -0.941566
Texas   0.991685  1.914198  1.655865
Oregon -2.131098 -1.005122 -0.576641

In [122]:
f = lambda x: x.max() - x.min()

In [123]:
frame.apply(f)

b    3.389777
d    2.919319
e    2.597432
dtype: float64

In [124]:
frame.apply(f, axis = "columns")

Utah      0.941725
Ohio      2.200245
Texas     0.922513
Oregon    1.554457
dtype: float64

In [125]:
def f(x):
   .....:     return pd.Series([x.min(), x.max()], index=['min', 'max'])

In [126]:
frame.apply(f)

            b         d         e
min -2.131098 -1.005122 -0.941566
max  1.258679  1.914198  1.655865

In [131]:
fr = lambda x: "{:.2f}".format(x)

In [133]:
frame.applymap(fr)

            b      d      e
Utah    -0.27  -0.49   0.45
Ohio     1.26   1.08  -0.94
Texas    0.99   1.91   1.66
Oregon  -2.13  -1.01  -0.58

In [134]:
frame["e"].map(fr)

Utah       0.45
Ohio      -0.94
Texas      1.66
Oregon    -0.58
Name: e, dtype: object

In [135]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [136]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [137]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [138]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
   .....:                      index=['three', 'one'],
   .....:                      columns=['d', 'a', 'b', 'c'])

In [139]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [140]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [141]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [142]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [143]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [144]:
obj.sort_values()

d    0
a    1
b    2
c    3
dtype: int64

In [146]:
obj.sort_values(ascending=False)

c    3
b    2
a    1
d    0
dtype: int64

In [147]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [148]:
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [149]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [150]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [153]:
frame.sort_values(by="a", ascending=False)

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [154]:
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [155]:
obj.rank()

0    3.0
1    NaN
2    4.0
3    NaN
4    1.0
5    2.0
dtype: float64

In [156]:
obj.rank(method="max")

0    3.0
1    NaN
2    4.0
3    NaN
4    1.0
5    2.0
dtype: float64

In [157]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [158]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [159]:
obj.index.is_unique

False

In [160]:
frame.index.is_unique

True

In [161]:
obj["a"]

a    0
a    1
dtype: int64

In [162]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
   .....:                    [np.nan, np.nan], [0.75, -1.3]],
   .....:                   index=['a', 'b', 'c', 'd'],
   .....:                   columns=['one', 'two'])

In [163]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [164]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [165]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [166]:
df.mean(axis=1)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [167]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [169]:
df.idxmax()

one    b
two    d
dtype: object

In [170]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [171]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [173]:
import pandas_datareader.data as web

In [174]:
all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

In [176]:
price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})

In [177]:
returns = price.pct_change()

In [178]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2018-03-26  0.047472  0.030972  0.030089  0.075705
2018-03-27 -0.025641 -0.045679 -0.009519 -0.045959
2018-03-28 -0.011049 -0.000537  0.004016 -0.000894
2018-03-29  0.007809  0.027106  0.005966  0.021031
2018-04-02 -0.006556 -0.024540 -0.021899 -0.030130

In [179]:
returns["MSFT"].corr(returns["IBM"])

0.48084780652123793

In [181]:
returns["MSFT"].cov(returns["IBM"])

8.1830301287281765e-05

In [182]:
returns.MSFT.corr(returns.IBM)

0.48084780652123793

In [183]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.426205  0.362084  0.413615
GOOG  0.426205  1.000000  0.397257  0.501120
IBM   0.362084  0.397257  1.000000  0.480848
MSFT  0.413615  0.501120  0.480848  1.000000

In [184]:
returns.corrwith(returns.IBM)

AAPL    0.362084
GOOG    0.397257
IBM     1.000000
MSFT    0.480848
dtype: float64

In [185]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [186]:
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [189]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [191]:
pd.value_counts(obj.values, sort=False)

a    3
c    3
b    2
d    1
dtype: int64

In [192]:
mask = obj.isin(["b", "a"])

In [193]:
mask

0    False
1     True
2    False
3     True
4     True
5     True
6     True
7    False
8    False
dtype: bool

In [194]:
obj[mask]

1    a
3    a
4    a
5    b
6    b
dtype: object

In [195]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])

In [196]:
unique_val = pd.Series(['c', 'b', 'a'])

In [197]:
to_match

0    c
1    a
2    b
3    b
4    c
5    a
dtype: object

In [198]:
pd.Index(unique_val).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [199]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
   .....:                      'Qu2': [2, 3, 1, 2, 3],
   .....:                      'Qu3': [1, 5, 2, 4, 4]})

In [200]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [203]:
data.apply(pd.value_counts).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0